Autodesk.Revit.DB.Electrical.ConduitSettings.GetConduitSettings(Autodesk.Revit.DB.Document)
Gets the conduit settings of the project.
document:
The document.
Returns:
The conduit settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings.UseAnnotationScaleForSingleLineFittings
Indicates whether use annotation scale for single line fittings or not.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings.RiseDropAnnotationSize
The rise drop annotation size.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for riseDropAnnotationSize must be between 0 and 30000 feet.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings.FittingAnnotationSize
The value of fitting annotation size.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for fittingAnnotationSize must be between 0 and 30000 feet.
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings.ConnectorSeparator
The conduit connector separator string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings.SizePrefix
The conduit size prefix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings.SizeSuffix
The conduit size suffix string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Electrical.ConduitSettings
The conduit settings.
Since:
2017